[
    {
        "text": "I know I’ve been missing for a while.\nLife threw a double punch - COVID and typhoid - and trust me, it wasn’t easy.\n\nA few days in the hospital, followed by weeks of slow recovery - physically, mentally, emotionally.\n\nSometimes, you don’t just need rest.\nYou need to pause.\n\nHealth issues aside, life hasn’t been easy lately.\nChallenges - some expected, most not - came in waves.\n\nAnd no matter how strong you are, there are moments where everything feels just… too much.\n\nBreathe.\nAnd be kind to yourself.\n\nThat’s exactly what I’ve been doing.\nI took a break. Logged off. Focused on healing.\n\nAnd now, step by step - I’m finding my way back.\nNot rushing. Just rebuilding - slowly and mindfully.\n\nTo everyone who checked in: thank you.\nTo everyone else navigating tough times: I see you. Take your time. Healing isn’t a race.\n\nI’m recovering.\nSlowly. Gently. One day at a time.\n\nTrying to find my rhythm again - without burning myself out.\n\nIf you’re going through something right now - whether it’s physical, mental, emotional -\n\nPlease know: it’s okay to pause.\n - It’s okay to fall behind.\n - It’s okay to not be okay.\n\nYou owe no one an explanation for choosing your peace.\nI’m still in that space - of reflection, realignment, and rebuilding.\n\nI’m coming back - one little step at a time.",
        "engagement": 149,
        "line_count": 37,
        "language": "English",
        "tags": [
            "Resilience",
            "Health"
        ]
    },
    {
        "text": "Job hunting in 2025 be like:\n\nApply.\nWait.\nGet ghosted.\nReapply to the same job because they reposted it again.\nStill ghosted.\nAttend 6 rounds of interviews.\nSolve a business case.\nDesign a product roadmap.\nFix the company’s entire strategy.\nOnly to hear:\n“We went ahead with another candidate.”\nAnd my personal favorite:\n“We’ll get back to you soon.”\n(They never do.)\n\nDear companies,\nWe don’t want coffee at your fancy office.\nWe just want clarity.\nA yes or a no.\n\nNot an existential crisis.\n\nTo all job seekers reading this -\nYou’re not lazy.\nYou’re not unskilled.\nYou’re not the problem.\n\nYou’re just stuck in a broken system where ‘hiring pipeline’ matters more than human dignity.\n\nSo no -\nYou’re not overreacting.\nYou’re just exhausted from proving your worth to people who never intended to hire.\n\nLet’s support each other.",
        "engagement": 112,
        "line_count": 27,
        "language": "English",
        "tags": [
            "Job Search",
            "Hiring Struggles"
        ]
    },
    {
        "text": "The job was posted 47 days ago.\nThen 22 days ago.\nThen 3 days ago.\nSame job.\nSame JD.\nSame company.\n\nYou applied all 3 times.\nStill no response.\nStill no update.\nStill nothing.\n\nHere’s the harsh truth:\nNot every job posting is real.\nNot every company is hiring.\nSome are just:\n\n🔹 Building a candidate pipeline\n🔹 Faking ‘growth’ for funding rounds\n🔹 Testing the talent market\n🔹 Showing activity to the board\n🔹 Reposting ghost jobs for visibility\n\nMeanwhile, jobseekers are customizing resumes, preparing for rounds, getting their hopes up -\nJust to be ghosted by something that never existed.\n\nIt’s not just frustrating.\nIt’s emotionally exhausting.\nIt’s mentally draining.\n\nIf you're a company doing this -\nYou’re not just wasting time.\nYou’re playing with people’s lives.\n\nTo everyone who’s applying, waiting, praying -\nThis isn’t your fault.\nYou’re not lacking.\nYou’re just stuck in a system that often values optics over ethics.\n\nSpeak up. Share this. Tag someone who needs to know this.\n\nBecause the only thing worse than not getting selected -\nis realizing the job never existed to begin with.",
        "engagement": 263,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Ghost Jobs",
            "Job Search"
        ]
    },
    {
        "text": "Some of the smartest people I know are jobless right now.\n\nNot because they’re lazy.\nNot because they don’t have skills.\nBut because the system is broken.\n\n– Companies post fake jobs.\n– They reopen the same roles every month.\n– Candidates solve 5-hour assignments and get ghosted.\n– Referrals go nowhere.\n– Rejections come in 2 minutes.\n– Or never.\n\nAnd yet we still say: *‘Keep applying. Your time will come.’*\n\nMaybe.\nBut maybe the problem isn't us.\nMaybe it’s the way hiring works — with no empathy, no accountability, no respect.\n\nIf you’re tired, frustrated, burnt out — you’re not alone.\nYou’re not a failure. You’re just stuck in a system that was never built to be kind.\n\nAnd I’m done pretending that’s normal.",
        "engagement": 312,
        "line_count": 25,
        "language": "English",
        "tags": [
            "Job Search",
            "Hiring System"
        ]
    },
    {
        "text": "Unpopular opinion:\n\nThe job market isn’t about talent anymore.\nIt’s about timing, luck, and how loud you can scream on LinkedIn.\n\nSome of the smartest people I know are unemployed.\nSome of the most average ones are getting promoted.\n\nWhy?\nBecause this game isn’t fair.\nIt never was.\n\nWe don’t reward loyalty.\nWe reward performative work.\nWe don’t hire for skill.\nWe hire who sounds skilled.\n\nSo if you're tired, bitter, or confused - you're not broken.\nYou're just awake.\n\nAwake enough to realize that sometimes…\nyou can do everything right and still be left behind.\n\nThis post is for the ones who aren’t clapping right now -\nbecause they’re still stuck in a loop.\n\nYou’re not invisible.\nYou’re just not loud yet.",
        "engagement": 198,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Career Development",
            "Job Market"
        ]
    },
    {
        "text": "Dear Companies,\n\nIf you want loyalty, pay people fairly.\nIf you want commitment, respect people’s time.\nIf you want passion, stop treating employees like robots.\n\nI don’t need ‘free snacks’ or ‘ping-pong tables.’\nI need trust, growth, and a work-life balance that doesn’t make me question my sanity.\n\nWe’re not here to hustle until we collapse.\nWe’re here to build careers, not burnout stories.\n\nLet’s stop glorifying ‘busy’ and start celebrating smart work.\n\nIf this resonates, share it.\nIf not, well… good luck keeping talent in 2025.",
        "engagement": 341,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Burnout",
            "Work-Life Balance"
        ]
    },
    {
        "text": "From Tinder to Instagram, bio toh important hai, babu.\nI’ve spent years thinking more words = better writing. Honestly, that’s just a fancy way to hide blabbering and incompetence.\n\nWhat looked easy on the surface, rewriting bio for brands turned out to be a \ncourse in clarity, tonality, and restraint.\n\nCan’t thank Jenil Chavda Sir enough. Supportive, sharp, sweet and genuinely one of the best writers and human beings I’ve learnt from.\nYashika M., you make design look unfairly easy. Am I jealous? Yes.",
        "engagement": 177,
        "line_count": 10,
        "language": "English",
        "tags": [
            "Bio Writing",
            "Writing"
        ]
    },
    {
        "text": "3 years into product management, I've realized the PMs who thrive long-term aren't the ones chasing the next shiny framework. They're the ones quietly investing in themselves. Here's what I've learned about building a career that survives layoffs, pivots, and whatever chaos comes next.\n\n1. Pick One Thing Outside Your Daily Grind\n\nChoose something small that stretches you. Maybe it's actually reading those analytics reports instead of skimming them, or navigating AI tools to simplify your tasks. Don't expect anyone to notice right away — that's not the point.\n\n2. Help People Around You\n\nPM is all about relationships. Help that engineer understand why users are frustrated, or spend time onboarding the new designer properly. These moments matter more than nailing your next roadmap presentation.\n\n3. Try Something That Might Fail\n\nDo something you've never done before. A PM I know started writing internal case studies about failed features. Sounds boring? It taught her to think critically about what went wrong and communicate those insights clearly. Skills that made her indispensable.\n\n4. Learn Something Every Quarter\n\nPick one thing per quarter. Maybe it's a skill that helps you excel at work, maybe it's how to actually say no to stakeholders without burning bridges. Small, consistent learning beats cramming for your next promotion.\n\n5. Stop Optimizing for Right Now\n\nAsk yourself: 'What kind of PM do I want to be in 5 years?' Not 'What gets me promoted next month.' The difference is learning to communicate vision vs. just learning the latest A/B testing tool.\n\n6. Follow What Actually Interests You\n\nDon't just chase resume bullets. Learn things because they're genuinely interesting, even if they seem useless. Understanding how customer support works, reading about behavioral psychology, or learning basic SQL — these 'random' skills often become your secret weapons.\n\n7. Build Habits That Stick\n\nFocus on what you can sustain long-term. Maybe it's spending 15 minutes every Friday reviewing what you learned that week. Pick something small and stick with it.\n\n8. Remember What You Actually Control\n\nCompanies restructure, products get killed, teams get reshuffled. But the way you think about problems, the people who trust you, and your ability to figure things out — that stuff travels with you everywhere.\n\n9. Invest in Yourself First\n\nThe work you do on yourself is the only permanent asset in your career. Every quarter, make some kind of deposit. That's how you go from someone who executes roadmaps to someone who shapes product strategy.\n\n10. Keep Going\n\nThe investment mindset is what separates PMs who survive from PMs who thrive. It's the only thing that never gets disrupted.",
        "engagement": 384,
        "line_count": 27,
        "language": "English",
        "tags": [
            "Career Development",
            "Product Management"
        ]
    },
    {
        "text": "If you are someone who is about to graduate and still looking for an opportunity, this one might be helpful.\n\nJob posting boards with easy apply, cold emails, career sites with applications all receive 1000s of leads everyday and might not be the most effective way to get your profile noticed.\n\nThe most effective way?\nGetting your profile reach the hiring team with a strong pitch.\n\nThe best way to do it?\nReferrals\n\nSharing everything you need to know Refferals (Save and share🚀):\n\nWhom to ask (in order of priority because this helps with faster reverts):\n\n1. Direct acquaintances, your WhatsApp connects or even college groups\n2. Your LinkedIn connections\n3. People who have hiring label in their profile, just go to company profile on LinkedIn -> people -> hiring\n\nAim at least 5 people for one company.\n\nSample referral Notes (these are the exact ones I used):\n\n📍While sending Connection request:\n\nHey [Name], How are you? \u2028I came across an opening at [company] for [z] role, [job id]. I graduated from [college] and have [x] years of experience in the Product team at [company]. I find myself a right fit for the role, can you refer me for the same?\n\n📍If connection request is accepted (you don’t want to delay this, be very proactive here):\n\nHey [Name], thanks for accepting my request.\nSharing you my resume below, would be really helpful if you could provide a referral.\n\n📍If they have shared resume with hiring team and you want to follow up:\n\nHey [Name],\nI was wondering if you could advise me on how I can track the progress of my application at [company]? Do you have a specific portal or should I follow up with someone directly?\n\nP.S: Don’t forget to follow up and keep a track that you actually have received a referral also.\n\n💡This trick will definitely help you increase conversions, only if you find the right person to get a referral from.\n\nDo try this out!",
        "engagement": 221,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Job Search",
            "Referrals"
        ]
    },
    {
        "text": "No matter what happens in the current market, you can’t take away the job of a product manager who’s:\n\n- Okay to not stick to frameworks \n- Okay to not use jargons and simplify \n- Okay to not say YES to every ask\n- Okay to not always make the flashiest deck\n- Okay to not having the final credit and get rewarded as a team\n\nPMs who focus on the basics and are user-first will always be in demand.\n\nIt’s just important to learn and keep adapting to new trends.",
        "engagement": 307,
        "line_count": 11,
        "language": "English",
        "tags": [
            "User-First",
            "Product Management"
        ]
    },
    {
        "text": "A lot of opportunities goes to those who aren’t the most qualified or fitted but to the ones who dare to take the risk.\n\nI was a very shy kid at school, and till my 12th standard if any teacher didn’t give me an opportunity or placed me at front in a dance competition, I would never even ask or pitch myself.\n\nMy entire thinking was based out of ‘If I deserve it, then it should come to me without asking for it and if I ask then I don’t deserve it’.\n\nIt’s been 8 years that I am out of school, and that thinking was the worst thing that I did to myself.\n\nHere’s what changed when I started asking:\n1. Becoming part of a club which had closed recruitment’s.\n2. Getting my first internship in software engineering even though I was from non-tech background.\n3. Getting an opportunity to speak at college events among 100s of students.\n4. Asking for the pay that I deserve.\n5. Getting ownership of a project and leading it end-to-end.\n\nAlong with a lot of other things.\n\nI didn’t beg for these things, but instead of accepting the scenarios I chose to pitch in and ask for what I deserved.\n\nPlease please always take a stand for yourself, because if you won’t then nobody else will.",
        "engagement": 289,
        "line_count": 23,
        "language": "English",
        "tags": [
            "Self-Advocacy",
            "Self Improvement"
        ]
    }
]